[GraphicalObject]
Name=IntegF
Path=
Title=
WndStyle=TOOLBAR
PosStyle=FIXED
X=0
Y=0
Width=600;400
Height=66
FrameThickness=0
Activate=0
EraseBk=0
Set0=
RC-DLL=HPCor008.DLL

[ToolDescriptor]
1 =Title , STATIC , HPGWCT02.DLL
2 =Integrate , PUSHBUTTON , hpgbut02.dll
3 =AutoIntegrate , PUSHBUTTON , hpgbut02.dll
4 =EditEvent , PUSHBUTTON , hpgbut02.dll
5 =ActualRpt , STATIC , HPGWCT02.DLL
6 =AddOnButton1 , PUSHBUTTON , hpgbut02.dll
7 =AddOnButton2 , PUSHBUTTON , hpgbut02.dll
8 =ReportOptions , PUSHBUTTON , hpgbut02.dll
9 =ReportPreview , PUSHBUTTON , hpgbut02.dll
10=ReportPrint , PUSHBUTTON , hpgbut02.dll
11=XMLExport , PUSHBUTTON , hpgbut02.dll
12 =ChemstoreTitle , STATIC , HPGWCT02.DLL
13=ChemstoreBar , GROUPFRAME, hpgbut02.dll
14=ChemstoreLock , PUSHBUTTON , hpgbut02.dll
15=ChemstoreClient , PUSHBUTTON , hpgbut02.dll

[STATIC Title]
Text1=積分 / レポート
Enable=1
x=0
y=3
width=176
height=17
Help=
FrameThickness=0
Justify=Left
TextColor=0,0,255

[PushButton Integrate]
ImageList=RBMP.Integrate|RBMP.Integrate|RBMP.Integrate_Disable|
x=0
y=25
width=40
height=40
Command=INT_BTNDoIntegFun Integrate
Help=現在のクロマトグラムを積分
FrameThickness=2

[PushButton AutoIntegrate]
ImageList=RBMP.AutoIntegrate|RBMP.AutoIntegrate|RBMP.AutoIntegrate_Disable|
x=40
y=25
width=40
height=40
Command=INT_BTNDoIntegFun AutoIntegrate
Help=自動積分: 現在のクロマトグラムに最適な積分パラメータで積分します
FrameThickness=2

[PushButton EditEvent]
ImageList=RBMP.EditEvents|RBMP.EditEvents|RBMP.EditEvents_Disable|
x=80
y=25
width=40
height=40
Command=INT_BTNDoIntegFun EditEvents
Help=積分イベント テーブル設定
FrameThickness=2

[PushButton AddOnButton1]
x=126
y=-999 ; 25
width=40
height=40
FrameThickness=2

[PushButton AddOnButton2]
x=166
y=-999 ; 25
width=40
height=40
FrameThickness=2

[STATIC ActualRpt]
Text1=
BKColor=255,255,255
Enable=1
Dimage=4
Justify=Center
x=206;212
y=3
width=165;166
height=17
Help=現在のレポート スタイル
FrameThickness=1
Font=ＭＳ Ｐゴシック,9,normal

[PushButton ReportOptions]
ImageList=RBMP.ReportOptions|RBMP.ReportOptions|RBMP.ReportOptions_Disable|
x=206;212 ; 196
y=25
width=40
height=40
Command=MenuRptParm
Help=レポート条件と印刷スタイルを選択します
FrameThickness=2

[PushButton ReportPreview]
ImageList=RBMP.ReportPreview|RBMP.ReportPreview|RBMP.ReportPreview_Disable|
x=248;254 ; 238
y=25
width=40
height=40
Command=MenuQuantify SCREEN
Help=ピーク定性、計算 & プレビュー
FrameThickness=2

[PushButton ReportPrint]
ImageList=RBMP.ReportPrint|RBMP.ReportPrint|RBMP.ReportPrint_Disable|
x=290;296 ; 280
y=25
width=40
height=40
Command=MenuQuantify PRINTER
Help=ピーク定性、定量結果 & レポートに出力
FrameThickness=2

[PushButton XMLExport]
ImageList=RBMP.XMLEXPORT|RBMP.XMLEXPORT|RBMP.XMLEXPORT_Disable|
x=332;338
y=25
width=40
height=40
Command=XML_ManualExportUpload
Help=ピーク定性、定量計算をし結果ファイルをリモート サーバにアップロードします
FrameThickness=2


[GROUPFRAME ChemstoreBar]
x=9999;374
y=2
width=4
height=68
Help=
FrameThickness=2

[PushButton ChemstoreLock]
enable=0
ImageList=RBMP.CSLOCK|RBMP.CSLOCK|RBMP.CSLOCKD|
x=9999;380
y=25
width=40
height=40
Command=ChemStoreLock.ChemStoreSessionLock 1,0
Help=Chemstation セッションをロック
FrameThickness=2

[PushButton ChemstoreClient]
enable=0
ImageList=RBMP.CSREVIEW|RBMP.CSREVIEW|RBMP.CSREVIEWD|
x=9999;422
y=25
width=40
height=40
Command=ChemStoreShowReviewClient
Help=Chemstore レビュー クライアント
FrameThickness=2

[STATIC ChemstoreTitle]
Text1=Chemstore
Enable=1
x=9999;380
y=3
width=150
height=17
Help=
FrameThickness=0
Justify=Left
TextColor=0,0,0
